from ..utils.class_with_int import class_with_int


class 서울Code:
    강남구 = 1
    강동구 = 2
    강북구 = 3
    강서구 = 4
    관악구 = 5
    광진구 = 6
    구로구 = 7
    금천구 = 8
    노원구 = 9
    도봉구 = 10
    동대문구 = 11
    동작구 = 12
    마포구 = 13
    서대문구 = 14
    서초구 = 15
    성동구 = 16
    성북구 = 17
    송파구 = 18
    양천구 = 19
    영등포구 = 20
    용산구 = 21
    은평구 = 22
    종로구 = 23
    중구 = 24
    중랑구 = 25


class 인천Code:
    강화군 = 1
    계양구 = 2
    미추홀구 = 3
    남동구 = 4
    동구 = 5
    부평구 = 6
    서구 = 7
    연수구 = 8
    옹진군 = 9
    중구 = 10


class 대전Code:
    대덕구 = 1
    동구 = 2
    서구 = 3
    유성구 = 4
    중구 = 5


class 대구Code:
    남구 = 1
    달서구 = 2
    달성군 = 3
    동구 = 4
    북구 = 5
    서구 = 6
    수성구 = 7
    중구 = 8
    군위군 = 9


class 광주Code:
    광산구 = 1
    남구 = 2
    동구 = 3
    북구 = 4
    서구 = 5


class 부산Code:
    강서구 = 1
    금정구 = 2
    기장군 = 3
    남구 = 4
    동구 = 5
    동래구 = 6
    부산진구 = 7
    북구 = 8
    사상구 = 9
    사하구 = 10
    서구 = 11
    수영구 = 12
    연제구 = 13
    영도구 = 14
    중구 = 15
    해운대구 = 16


class 울산Code:
    중구 = 1
    남구 = 2
    동구 = 3
    북구 = 4
    울주군 = 5


class 세종특별자치시Code:
    세종특별자치시 = 1


class 경기도Code:
    가평군 = 1
    고양시 = 2
    과천시 = 3
    광명시 = 4
    광주시 = 5
    구리시 = 6
    군포시 = 7
    김포시 = 8
    남양주시 = 9
    동두천시 = 10
    부천시 = 11
    성남시 = 12
    수원시 = 13
    시흥시 = 14
    안산시 = 15
    안성시 = 16
    안양시 = 17
    양주시 = 18
    양평군 = 19
    여주시 = 20
    연천군 = 21
    오산시 = 22
    용인시 = 23
    의왕시 = 24
    의정부시 = 25
    이천시 = 26
    파주시 = 27
    평택시 = 28
    포천시 = 29
    하남시 = 30
    화성시 = 31


class 강원특별자치도Code:
    강릉시 = 1
    고성군 = 2
    동해시 = 3
    삼척시 = 4
    속초시 = 5
    양구군 = 6
    양양군 = 7
    영월군 = 8
    원주시 = 9
    인제군 = 10
    정선군 = 11
    철원군 = 12
    춘천시 = 13
    태백시 = 14
    평창군 = 15
    홍천군 = 16
    화천군 = 17
    횡성군 = 18


class 충청북도Code:
    괴산군 = 1
    단양군 = 2
    보은군 = 3
    영동군 = 4
    옥천군 = 5
    음성군 = 6
    제천시 = 7
    진천군 = 8
    청원군 = 9
    청주시 = 10
    충주시 = 11
    증평군 = 12


class 충청남도Code:
    공주시 = 1
    금산군 = 2
    논산시 = 3
    당진시 = 4
    보령시 = 5
    부여군 = 6
    서산시 = 7
    서천군 = 8
    아산시 = 9
    예산군 = 11
    천안시 = 12
    청양군 = 13
    태안군 = 14
    홍성군 = 15
    계룡시 = 16


class 경상북도Code:
    경산시 = 1
    경주시 = 2
    고령군 = 3
    구미시 = 4
    김천시 = 6
    문경시 = 7
    봉화군 = 8
    상주시 = 9
    성주군 = 10
    안동시 = 11
    영덕군 = 12
    영양군 = 13
    영주시 = 14
    영천시 = 15
    예천군 = 16
    울릉군 = 17
    울진군 = 18
    의성군 = 19
    청도군 = 20
    청송군 = 21
    칠곡군 = 22
    포항시 = 23


class 경상남도Code:
    거제시 = 1
    거창군 = 2
    고성군 = 3
    김해시 = 4
    남해군 = 5
    마산시 = 6
    밀양시 = 7
    사천시 = 8
    산청군 = 9
    양산시 = 10
    의령군 = 12
    진주시 = 13
    진해시 = 14
    창녕군 = 15
    창원시 = 16
    통영시 = 17
    하동군 = 18
    함안군 = 19
    함양군 = 20
    합천군 = 21


class 전북특별자치도Code:
    고창군 = 1
    군산시 = 2
    김제시 = 3
    남원시 = 4
    무주군 = 5
    부안군 = 6
    순창군 = 7
    완주군 = 8
    익산시 = 9
    임실군 = 10
    장수군 = 11
    전주시 = 12
    정읍시 = 13
    진안군 = 14


class 전라남도Code:
    강진군 = 1
    고흥군 = 2
    곡성군 = 3
    광양시 = 4
    구례군 = 5
    나주시 = 6
    담양군 = 7
    목포시 = 8
    무안군 = 9
    보성군 = 10
    순천시 = 11
    신안군 = 12
    여수시 = 13
    영광군 = 16
    영암군 = 17
    완도군 = 18
    장성군 = 19
    장흥군 = 20
    진도군 = 21
    함평군 = 22
    해남군 = 23
    화순군 = 24


class 제주도Code:
    남제주군 = 1
    북제주군 = 2
    서귀포시 = 3
    제주시 = 4


class AreaCode:
    서울 = class_with_int(서울Code, 1)
    인천 = class_with_int(인천Code, 2)
    대전 = class_with_int(대전Code, 3)
    대구 = class_with_int(대구Code, 4)
    광주 = class_with_int(광주Code, 5)
    부산 = class_with_int(부산Code, 6)
    울산 = class_with_int(울산Code, 7)
    세종특별자치시 = class_with_int(세종특별자치시Code, 8)
    경기도 = class_with_int(경기도Code, 31)
    강원특별자치도 = class_with_int(강원특별자치도Code, 32)
    충청북도 = class_with_int(충청북도Code, 33)
    충청남도 = class_with_int(충청남도Code, 34)
    경상북도 = class_with_int(경상북도Code, 35)
    경상남도 = class_with_int(경상남도Code, 36)
    전북특별자치도 = class_with_int(전북특별자치도Code, 37)
    전라남도 = class_with_int(전라남도Code, 38)
    제주도 = class_with_int(제주도Code, 39)
